<?php

namespace App\Repositories\SetMenuRepository;

use App\Models\{
    Menu,
    SetMenu,
};

interface SetMenuRepositoryInterface
{
    /***********************************************************
     * Create系
     ***********************************************************/
    /**
     * セットメニューを作成する
     * @param Menu $menu
     * @param array $data 作成に必要なデータ
     * @return SetMenu 作成されたセットメニュー
     */
    public function createSetMenu(Menu $menu, array $data): SetMenu;

    /***********************************************************
     * Read系
     ***********************************************************/
    /**
     * メニューに属するセットメニューを取得する
     * @param Menu $menu
     * @return ?SetMenu
     */
    public function getMenuSetMenu(Menu $menu): ?SetMenu;

    /***********************************************************
     * Update系
     ***********************************************************/

    /***********************************************************
     * Delete系
     ***********************************************************/

    /***********************************************************
     * その他
     ***********************************************************/
}
